Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="64bc746f-49d7-4ab4-84dd-3377fcefa0f7">
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/гкс_ПроизвольныеНастройкиИнтеграций/гкс_ПроизвольныеНастройкиИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f7954be1-86f2-4e13-9837-d2a42dc4d403">
  <name>гкс_ПроизвольныеНастройкиИнтеграций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9f8eb78e-1cbe-41e9-9240-35ef4ace121a">
    <name>ДопСвойства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="05eaf328-d5be-4e7b-90f6-0c245f5888bc">
    <name>Свойства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4057ede0-2c77-4630-ba90-13eae2cb911b">
      <name>Ключ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7dbc80a5-8863-4cec-b3b3-b3c76d03b314">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/гкс_ИнтеграцияERP2/Module.bsl
#Область ПрограммныйИнтерфейс  
  
// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Изменено:{
Функция ПолучитьДанныеПоНоменклатуре(ЗаявкаНаРемонт = Неопределено, Организация = Неопределено, СписокНоменклатуры) Экспорт  //Зозуля 510+ Доб. Организация
		
	ТаблицаВозврата	= Новый ТаблицаЗначений;
	
	// Гкс+[TOIR20-517] Льговский Р.Н. от 03.02.2025. Добавлено:{
	Если Организация = Неопределено Тогда 
		ПолучитьТолькоСегмент = Истина
	Иначе
		ПолучитьТолькоСегмент = Ложь
	КонецЕсли;
	
	Если ПолучитьТолькоСегмент Тогда 
		ТаблицаВозврата.Колонки.Добавить("Номенклатура");
		ТаблицаВозврата.Колонки.Добавить("Наименование");   //Номенклатуры
		ТаблицаВозврата.Колонки.Добавить("Сегмент"); 
	// } Гкс-[TOIR20-517] Льговский Р.Н от 03.02.2025.
	Иначе
		ТаблицаВозврата.Колонки.Добавить("Номенклатура");
		ТаблицаВозврата.Колонки.Добавить("Наименование");   //Номенклатуры
		ТаблицаВозврата.Колонки.Добавить("гкс_ВНаличии");
		ТаблицаВозврата.Колонки.Добавить("гкс_ИнформацияОбОстатках");
		ТаблицаВозврата.Колонки.Добавить("гкс_СрокПоставки");
		ТаблицаВозврата.Колонки.Добавить("гкс_ДатаСогласованияДО");
		ТаблицаВозврата.Колонки.Добавить("гкс_ВРаботеУОМТС");
		ТаблицаВозврата.Колонки.Добавить("гкс_ДатаЗаказаПоставщику");
		ТаблицаВозврата.Колонки.Добавить("гкс_КоличествоВЗаказе");
		ТаблицаВозврата.Колонки.Добавить("гкс_ДатаПоставки");
		// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Добавлено:{
		ТаблицаВозврата.Колонки.Добавить("гкс_ТМЦВПути");
		// } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025. 
		// Гкс+[TOIR20-528] Вялых Д.А. от 05.02.2025. Добавлено:{	
        ТаблицаВозврата.Колонки.Добавить("гкс_Отгрузить");
		// } Гкс-[TOIR20-528] Вялых Д.А. от 05.02.2025.
		// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
		ТаблицаВозврата.Колонки.Добавить("гкс_ВключенВЗаказ");
		ТаблицаВозврата.Колонки.Добавить("гкс_КоличествоВПеремещении");
		// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	КонецЕсли;
			
	СтруктураЗапроса	= Новый Структура;
	СтруктураЗапроса.Вставить("GUIDЗаявкиНаРемонт", XMLСтрока(ЗаявкаНаРемонт));
	// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Добавлено:{
	СтруктураЗапроса.Вставить("Организация", XMLСтрока(Организация));
	// } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025.
	СтруктураЗапроса.Вставить("Номенклатура", Новый СписокЗначений);
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		СтруктураЗапроса.Номенклатура.Добавить(XMLСтрока(ТекСтрока.Значение));
	КонецЦикла;	
			                               
	ВебСервис = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеERP2;
		
	ИменаРеквизитовПодключения = "Сервер, Порт, Таймаут, ИспользоватьЗащищенноеСоединение";
	РеквизитыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВебСервис, ИменаРеквизитовПодключения);
		
	ТаймаутРекомендация = 60;
	Таймаут = ?(РеквизитыПодключения.Таймаут = 0, ТаймаутРекомендация, РеквизитыПодключения.Таймаут);
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Аутентификация = ЛогинПарольПользователя(ВебСервис);
	
	Соединение = Новый HTTPСоединение(РеквизитыПодключения.Сервер,,Аутентификация.Пользователь, Аутентификация.Пароль,,
		Таймаут, ЗащищенноеСоединение, Аутентификация.ИспользоватьАутентификациюОС);
		
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.AvailabilityOfGoods;
	РеквизитыВыполнения = РеквизитыВыполненияВебСервиса(РесурсВебСервиса);			
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	ТелоЗапроса = ЗаписьJSON.Закрыть();	
	
	СтрокаАвторизации = СтрокаАвторизацииЗапроса(Соединение);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json"); 
	Заголовки.Вставить("Authorization", СтрокаАвторизации);
	
	
	Запрос = Новый HTTPЗапрос(РеквизитыВыполнения.СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);				
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(РеквизитыВыполнения.ИмяМетода, Запрос);
	Исключение
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка при выполнении HTTP запроса: %1'"), ОписаниеОшибки()));			
		
	КонецПопытки; 
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ЧтениеJSON	= Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураВозврата	= СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		Если ТипЗнч(СтруктураВозврата) = Тип("Структура")
			И СтруктураВозврата.Свойство("Данные") Тогда
			
			Для Каждого ТекСтрока Из СтруктураВозврата.Данные Цикл
				НоваяСтрока = ТаблицаВозврата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.
				ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.GUID));				
			КонецЦикла;
		ИначеЕсли ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
			
			ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
			УровеньЖурналаРегистрации.Ошибка,
			, 
			, 
			СтруктураВозврата)
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка запроса к сервису код : %1'"), Ответ.КодСостояния));
					
	КонецЕсли;
	
	Возврат ТаблицаВозврата;
	
КонецФункции         
// } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025.

Функция ПолучитьДанныеОтчетОбеспечениеРемонтовТМЦ(ЗаявкаНаРемонт, СписокНоменклатуры) Экспорт  
		
	ТаблицаВозврата	= Новый ТаблицаЗначений; 
	
	ТаблицаВозврата= Новый ТаблицаЗначений;
	ТаблицаВозврата.Колонки.Добавить("ЗаявкаНаРемонт");
	ТаблицаВозврата.Колонки.Добавить("Номенклатура");   //Номенклатуры
	ТаблицаВозврата.Колонки.Добавить("ТоварнаяКатегория", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("СвободныеОстатки", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаВозврата.Колонки.Добавить("ВНаличииИтого", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаВозврата.Колонки.Добавить("Склад", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("НомерЗаказНаПеремещение", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	ТаблицаВозврата.Колонки.Добавить("гкс_ДатаСогласованияДО", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("МенеджерПоЗакупкам", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("СрокПоставки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаВозврата.Колонки.Добавить("НомерЗП", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	ТаблицаВозврата.Колонки.Добавить("Партнер", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаВозврата.Колонки.Добавить("ДатаЗП", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3)); 
	ТаблицаВозврата.Колонки.Добавить("ДатаПоступления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));

	Если ЗаявкаНаРемонт.Количество() = 0 ИЛИ СписокНоменклатуры.Количество() = 0 Тогда
		Возврат ТаблицаВозврата;	
	КонецЕсли;
	
	СтруктураЗапроса	= Новый Структура;
	СтруктураЗапроса.Вставить("GUIDЗаявкиНаРемонт", Новый СписокЗначений);
	СтруктураЗапроса.Вставить("GUIDНоменклатура", Новый СписокЗначений);
	
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		СтруктураЗапроса.GUIDНоменклатура.Добавить(XMLСтрока(ТекСтрока.Значение));
	КонецЦикла;
	Для Каждого ТекСтрока Из ЗаявкаНаРемонт Цикл
		СтруктураЗапроса.GUIDЗаявкиНаРемонт.Добавить(XMLСтрока(ТекСтрока.Значение));
	КонецЦикла;
			                               
	ВебСервис = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеERP2;
		
	ИменаРеквизитовПодключения = "Сервер, Порт, Таймаут, ИспользоватьЗащищенноеСоединение";
	РеквизитыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВебСервис, ИменаРеквизитовПодключения);
		
	ТаймаутРекомендация = 60;
	Таймаут = ?(РеквизитыПодключения.Таймаут = 0, ТаймаутРекомендация, РеквизитыПодключения.Таймаут);
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Аутентификация = ЛогинПарольПользователя(ВебСервис);
	
	Соединение = Новый HTTPСоединение(РеквизитыПодключения.Сервер,,Аутентификация.Пользователь, Аутентификация.Пароль,,
		Таймаут, ЗащищенноеСоединение, Аутентификация.ИспользоватьАутентификациюОС);
		
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.SuppliesInventoryАssets;
	РеквизитыВыполнения = РеквизитыВыполненияВебСервиса(РесурсВебСервиса);			
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	ТелоЗапроса = ЗаписьJSON.Закрыть();	
	
	СтрокаАвторизации = СтрокаАвторизацииЗапроса(Соединение);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json"); 
	Заголовки.Вставить("Authorization", СтрокаАвторизации);
	
	
	Запрос = Новый HTTPЗапрос(РеквизитыВыполнения.СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);				
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(РеквизитыВыполнения.ИмяМетода, Запрос);
	Исключение
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка при выполнении HTTP запроса: %1'"), ОписаниеОшибки()));			
		
	КонецПопытки; 
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ЧтениеJSON	= Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураВозврата	= СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		Если ТипЗнч(СтруктураВозврата) = Тип("Структура")
			И СтруктураВозврата.Свойство("Данные") Тогда
			
			Для Каждого ТекСтрока Из СтруктураВозврата.Данные Цикл
				НоваяСтрока = ТаблицаВозврата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.GUID)); 
				НоваяСтрока.ЗаявкаНаРемонт	= Документы.торо_ЗаявкаНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.ИДЗаявкаНаРемонт));
			КонецЦикла;
		ИначеЕсли ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
			
			ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
		УровеньЖурналаРегистрации.Ошибка,
			, 
			, 
			СтруктураВозврата)
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение остатков номенклатуры",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка запроса к сервису код : %1'"), Ответ.КодСостояния));
					
	КонецЕсли;
	
	Возврат ТаблицаВозврата;
	
КонецФункции

Функция ПолучитьНавигационнуюСсылкуЗаказаНаПеремещение(ЗаявкаНаРемонт, Номенклатура) Экспорт  
	
	НавигационнаяСсылка = "";
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаРемонт) ИЛИ НЕ ЗначениеЗаполнено(Номенклатура) Тогда
	 Возврат НавигационнаяСсылка;	
	КонецЕсли;
	
	СтруктураЗапроса	= Новый Структура;
	СтруктураЗапроса.Вставить("GUIDЗаявкиНаРемонт", XMLСтрока(ЗаявкаНаРемонт));
	СтруктураЗапроса.Вставить("Номенклатура", XMLСтрока(Номенклатура));
	
			                               
	ВебСервис = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеERP2;
		
	ИменаРеквизитовПодключения = "Сервер, Порт, Таймаут, ИспользоватьЗащищенноеСоединение";
	РеквизитыПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВебСервис, ИменаРеквизитовПодключения);
		
	ТаймаутРекомендация = 60;
	Таймаут = ?(РеквизитыПодключения.Таймаут = 0, ТаймаутРекомендация, РеквизитыПодключения.Таймаут);
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Аутентификация = ЛогинПарольПользователя(ВебСервис);
	
	Соединение = Новый HTTPСоединение(РеквизитыПодключения.Сервер,,Аутентификация.Пользователь, Аутентификация.Пароль,,
		Таймаут, ЗащищенноеСоединение, Аутентификация.ИспользоватьАутентификациюОС);
		
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.ClientApplicationWindow;
	РеквизитыВыполнения = РеквизитыВыполненияВебСервиса(РесурсВебСервиса);			
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	ТелоЗапроса = ЗаписьJSON.Закрыть();	
	
	СтрокаАвторизации = СтрокаАвторизацииЗапроса(Соединение);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json"); 
	Заголовки.Вставить("Authorization", СтрокаАвторизации);
	
	
	Запрос = Новый HTTPЗапрос(РеквизитыВыполнения.СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);				
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(РеквизитыВыполнения.ИмяМетода, Запрос);
	Исключение
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение навигационной ссылки",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка при выполнении HTTP запроса: %1'"), ОписаниеОшибки()));			
		
	КонецПопытки; 
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ЧтениеJSON	= Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураВозврата	= СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON); 
		
		НавигационнаяСсылка = СтруктураВозврата.Данные;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Интеграция ERP2.Получение навигационной ссылки",
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка запроса к сервису код : %1'"), Ответ.КодСостояния));
					
	КонецЕсли;
	
	Возврат НавигационнаяСсылка;
	
КонецФункции

// Предоставляет данные для сводного отчета ERP2.
// Вызывается из http-сервиса ERP2IntegrationService /SummaryReport
// 
// Параметры:
//  СтруктураПараметров - Структура - 
// 
// Возвращаемое значение:
//  Структура - Получить данные для сводного отчета ERP2:
// * Данные - ТаблицаЗначений - :
// ** ЗаявкаТОиР - Строка 
// ** НомерТОиР - Строка
// ** ОписаниеРаботТОиР - Строка
// ** НуженОстанов - Строка
// ** ДатаСозданияТОиР - Дата
// ** АктуальнаяДатаНачалаРабот - Дата
// ** АктуальнаяДатаОкончанияРабот - Дата
// ** СтатусЗаявкиТОиР - Строка
// ** ЭтапСогласованияТОиР - Строка
// ** ДатаНаправленияВОтделЗУ - Дата
// ** ДатаНачалаОбработкиЗаявки - Дата
// ** ЗаявкаВРаботеДней - Число
// ** ДатаВыбораПоставщика - Дата
Функция ПолучитьДанныеДляСводногоОтчетаERP2(СтруктураПараметров) Экспорт 

	РезультатВозврата	= Новый Структура;		        
	ТаблицаВозврата	= Новый ТаблицаЗначений;
	ТаблицаВозврата.Колонки.Добавить("ЗаявкаТОиР", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("НомерТОиР", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	ТаблицаВозврата.Колонки.Добавить("ОписаниеРаботТОиР", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	ТаблицаВозврата.Колонки.Добавить("НуженОстанов", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ТаблицаВозврата.Колонки.Добавить("ДатаСозданияТОиР", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("АктуальнаяДатаНачалаРабот", ОбщегоНазначения.ОписаниеТипаДата(
		ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("АктуальнаяДатаОкончанияРабот", ОбщегоНазначения.ОписаниеТипаДата(
		ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("СтатусЗаявкиТОиР", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("ЭтапСогласованияТОиР", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВозврата.Колонки.Добавить("ДатаНаправленияВОтделЗУ", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("ДатаНачалаОбработкиЗаявки", ОбщегоНазначения.ОписаниеТипаДата(
		ЧастиДаты.ДатаВремя));
	ТаблицаВозврата.Колонки.Добавить("ЗаявкаВРаботеДней", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаВозврата.Колонки.Добавить("ДатаВыбораПоставщика", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));

	НомераЗаявок = "";
	Если СтруктураПараметров.Свойство("НомераЗаявок") Тогда
	   	НомераЗаявок	= СтруктураПараметров.НомераЗаявок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомераЗаявок) Тогда

		ВыбранаПодряднаяОрганизация = 
			ПланыВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты.ПроизвольныйПредопределенныйОбъект(
			"СтатусСогласованияВыбранаПодряднаяОрганизация");
		ДляСМТСОтГлСпециалиста = 
			ПланыВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты.ПроизвольныйПредопределенныйОбъект(
			"СтатусСогласованияДляСМТСОтГлСпециалиста");
		ПринятоВРаботуСМТС = 
			ПланыВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты.ПроизвольныйПредопределенныйОбъект(
			"СтатусСогласованияПринятоВРаботуСМТС");

		Настройка = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.СтатусыЗаявокКВыгрузке;
		СоответствиеСтатусовЗаявок = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.ПолучитьСвойства(Настройка,
			"Свойства");
		МассивСтатусовЗаявок = Новый Массив;

		Для Каждого Элемент Из СоответствиеСтатусовЗаявок Цикл
			Если Элемент.Значение = ПринятоВРаботуСМТС Тогда
				Продолжить;
			КонецЕсли;
			МассивСтатусовЗаявок.Добавить(Элемент.Значение);
		КонецЦикла;

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаДанныеПоЗаявкам();
		
		Запрос.УстановитьПараметр("НомераЗаявок", НомераЗаявок);
		Запрос.УстановитьПараметр("ВыбранаПодряднаяОрганизация", ВыбранаПодряднаяОрганизация);
		Запрос.УстановитьПараметр("ДляСМТСОтГлСпециалиста", ДляСМТСОтГлСпециалиста); 
		Запрос.УстановитьПараметр("ПринятоВРаботуСМТС", ПринятоВРаботуСМТС);
		Запрос.УстановитьПараметр("СтатусыЗаявок", МассивСтатусовЗаявок);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаВозврата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;

	КонецЕсли;
		
	РезультатВозврата.Вставить("Данные", ТаблицаВозврата);
	
	Возврат РезультатВозврата;
		
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЛогинПарольПользователя(ВебСервис)
	
	ИспользоватьАутентификациюОС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВебСервис,
		"ИспользоватьАутентификациюОС");
	
	Аутентификация = Новый Структура("ИспользоватьАутентификациюОС, Пользователь, Пароль",
		ИспользоватьАутентификациюОС, "", "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВебСервис, "ИмяПарольПользователя");
	
	Если ЗначениеЗаполнено(ИмяПароль) Тогда
		Аутентификация.Пользователь = ИмяПароль.ИмяПользователя;
		Аутентификация.Пароль = ИмяПароль.ПарольПользователя; 		
	КонецЕсли;
	
	Возврат Аутентификация;
	
КонецФункции

Функция РеквизитыВыполненияВебСервиса(ВебСервис)
	
	ИменаРеквизитов = Новый Структура();
	ИменаРеквизитов.Вставить("СтрокаЗапроса", "URL");
	ИменаРеквизитов.Вставить("ИмяМетода", "Метод");
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВебСервис, ИменаРеквизитов);
	
КонецФункции

Функция СтрокаАвторизацииЗапроса(ПараметрыПодключения)
	
	ИмяПользователя = ПараметрыПодключения.Пользователь;
	Пароль = ПараметрыПодключения.Пароль;
	
	ШаблонСтроки = "%1:%2";
	СтрокаАвторизации = СтрШаблон(ШаблонСтроки, ИмяПользователя, Пароль);
	ДвоичныеДанныеСтроки = 
		ПолучитьДвоичныеДанныеИзСтроки(СтрокаАвторизации, КодировкаТекста.UTF8, Ложь);
		
	Возврат 
		СтрШаблон("%1%2", "Basic " , ПолучитьBase64СтрокуИзДвоичныхДанных(ДвоичныеДанныеСтроки));
		
КонецФункции
	
Функция ЗаголовокЗапроса(СтрокаАвторизации)
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json"); // "application/json; charset=utf-8"
	Заголовки.Вставить("Authorization", СтрокаАвторизации);
	Заголовки.Вставить("Accept", "application/json"); // "application/json; charset=utf-8"
	
	Возврат Заголовки;

КонецФункции

Функция ТекстЗапросаДанныеПоЗаявкам()
	
Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ЗаявкаНаРемонт.Ссылка КАК Заявка,
	        |	ЗаявкаНаРемонт.Номер КАК Номер,
	        |	ЗаявкаНаРемонт.Дата КАК ДатаСоздания,
	        |	ЗаявкаНаРемонт.гкс_НуженОстанов КАК НуженОстанов,
	        |	ЕСТЬNULL(ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта, """") КАК ОписаниеРемонта,
	        |	ЕСТЬNULL(АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК АктуальнаяДатаНачалаРабот,
	        |	ЕСТЬNULL(АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК АктуальнаяДатаОкончанияРабот,
	        |	ЕСТЬNULL(ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка)) КАК ЭтапСогласования
	        |ПОМЕСТИТЬ ВТЗаявки
	        |ИЗ
	        |	Документ.торо_ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаНаРемонтРемонтыОборудования
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК АктуальныеПлановыеДатыРемонтов
	        |			ПО ЗаявкаНаРемонтРемонтыОборудования.ID = АктуальныеПлановыеДатыРемонтов.IDРемонта
	        |		ПО ЗаявкаНаРемонт.Ссылка = ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК ТекущиеСтатусыСогласованияДокументов
	        |		ПО ЗаявкаНаРемонт.Ссылка = ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
	        |ГДЕ
	        |	ЗаявкаНаРемонт.Номер В(&НомераЗаявок)
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Заявка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	СтатусыДокументовЗаявокСрезПоследних.ИзменяемыйДокумент КАК ИзменяемыйДокумент,
	        |	СтатусыДокументовЗаявокСрезПоследних.СтатусДокумента КАК СтатусДокумента
	        |ПОМЕСТИТЬ ВТСтатусы
	        |ИЗ
	        |	РегистрСведений.торо_СтатусыДокументовЗаявок.СрезПоследних(
	        |			,
	        |			СтатусУстановлен
	        |				И ИзменяемыйДокумент В
	        |					(ВЫБРАТЬ
	        |						ВТЗаявки.Заявка КАК Заявка
	        |					ИЗ
	        |						ВТЗаявки КАК ВТЗаявки)) КАК СтатусыДокументовЗаявокСрезПоследних
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ИзменяемыйДокумент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ИсторияСтатусовСогласованияДокументов.СогласуемыйДокумент КАК СогласуемыйДокумент,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА ИсторияСтатусовСогласованияДокументов.СтатусДокумента В (&СтатусыЗаявок)
	        |				ТОГДА ИсторияСтатусовСогласованияДокументов.Период
	        |		КОНЕЦ) КАК ДатаНаправленияВОтделЗакупок,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА ИсторияСтатусовСогласованияДокументов.СтатусДокумента = &ПринятоВРаботуСМТС
	        |				ТОГДА ИсторияСтатусовСогласованияДокументов.Период
	        |		КОНЕЦ) КАК ДатаНачалаОбработкиЗаявки,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА ИсторияСтатусовСогласованияДокументов.СтатусДокумента = &ВыбранаПодряднаяОрганизация
	        |				ТОГДА ИсторияСтатусовСогласованияДокументов.Период
	        |		КОНЕЦ) КАК ДатаНазначенияПодряднойОрганизации
	        |ПОМЕСТИТЬ ВТИсторияСогласования
	        |ИЗ
	        |	РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК ИсторияСтатусовСогласованияДокументов
	        |ГДЕ
	        |	ИсторияСтатусовСогласованияДокументов.СогласуемыйДокумент В
	        |			(ВЫБРАТЬ
	        |				ВТЗаявки.Заявка КАК Заявка
	        |			ИЗ
	        |				ВТЗаявки КАК ВТЗаявки)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ИсторияСтатусовСогласованияДокументов.СогласуемыйДокумент
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	СогласуемыйДокумент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(ВТЗаявки.Заявка) КАК ЗаявкаТОиР,
	        |	ВТЗаявки.Номер КАК НомерТОиР,
	        |	ВТЗаявки.ДатаСоздания КАК ДатаСозданияТОиР,
	        |	ВТЗаявки.ОписаниеРемонта КАК ОписаниеРаботТОиР,
	        |	ВТЗаявки.НуженОстанов КАК НуженОстанов,
	        |	ВТЗаявки.АктуальнаяДатаНачалаРабот КАК АктуальнаяДатаНачалаРабот,
	        |	ВТЗаявки.АктуальнаяДатаОкончанияРабот КАК АктуальнаяДатаОкончанияРабот,
	        |	ПРЕДСТАВЛЕНИЕ(ВТЗаявки.ЭтапСогласования) КАК ЭтапСогласованияТОиР,
	        |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(ВТСтатусы.СтатусДокумента), """") КАК СтатусЗаявкиТОиР,
	        |	ЕСТЬNULL(ВТИсторияСогласования.ДатаНаправленияВОтделЗакупок, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНаправленияВОтделЗУ,
	        |	ЕСТЬNULL(ВТИсторияСогласования.ДатаНачалаОбработкиЗаявки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаОбработкиЗаявки,
	        |	ВЫБОР
	        |		КОГДА НЕ ВТИсторияСогласования.ДатаНачалаОбработкиЗаявки ЕСТЬ NULL
	        |			ТОГДА ВЫБОР
	        |					КОГДА НЕ ВТИсторияСогласования.ДатаНазначенияПодряднойОрганизации ЕСТЬ NULL
	        |						ТОГДА РАЗНОСТЬДАТ(ВТИсторияСогласования.ДатаНачалаОбработкиЗаявки, ВТИсторияСогласования.ДатаНазначенияПодряднойОрганизации, ДЕНЬ)
	        |					ИНАЧЕ РАЗНОСТЬДАТ(ВТИсторияСогласования.ДатаНачалаОбработкиЗаявки, &ТекущаяДата, ДЕНЬ)
	        |				КОНЕЦ
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ЗаявкаВРаботеДней,
	        |	ЕСТЬNULL(ВТИсторияСогласования.ДатаНазначенияПодряднойОрганизации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыбораПоставщика
	        |ИЗ
	        |	ВТЗаявки КАК ВТЗаявки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусы КАК ВТСтатусы
	        |		ПО ВТЗаявки.Заявка = ВТСтатусы.ИзменяемыйДокумент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсторияСогласования КАК ВТИсторияСогласования
	        |		ПО ВТЗаявки.Заявка = ВТИсторияСогласования.СогласуемыйДокумент";
	
	
КонецФункции	

#КонецОбласти
